Feature: Управление на библиотеката с игри

  Background: Отваряне на приложението
    Given отваряне на приложението

  Scenario: Добавяне на нова игра към библиотеката
    When потребителят добавя нова игра с име "Adventure Quest"
    Then системата трябва да добави играта "Adventure Quest" в библиотеката

  Scenario: Премахване на игра от библиотеката
    Given потребителят има игра с име "Adventure Quest" в библиотеката
    When потребителят премахва играта "Adventure Quest" от библиотеката
    Then системата не трябва да съдържа играта "Adventure Quest" в библиотеката

  Scenario: Навигиране до библиотеката с игри
    When потребителят навигира до секцията с библиотеката с игри
    Then системата трябва да покаже списък с игри в библиотеката

  Scenario: Преглеждане на детайли за игра
    Given потребителят има игра с име "Adventure Quest" в библиотеката
    When потребителят кликва върху играта "Adventure Quest" в библиотеката
    Then системата трябва да покаже детайли за играта "Adventure Quest"

  Scenario: Търсене на игра в библиотеката
    Given потребителят има следните игри в библиотеката:
      | Name             |
      | Adventure Quest |
      | Battle Royale   |
    When потребителят търси за игра с име "Adventure Quest" в библиотеката
    Then системата трябва да покаже играта "Adventure Quest" в резултатите от търсенето
